spec/fixtures/address_no_shipping.xml

<?xml version="1.0" encoding="UTF-8"?>
<export>
  <export_location>unknown</export_location>
  <order>
    <merchant_id>ABC</merchant_id>
    <order_id>ABC-12345</order_id>
    <order_date>01 JAN 2015 10:00:00</order_date>
    <order_type>credit card</order_type>
    <current_stage>REJ</current_stage>
    <payment_status>Refunded</payment_status>
    <payment_date>01/01/2015</payment_date>
    <payment_date_time>01 JAN 2015 10:00:00</payment_date_time>
    <bill_to_company>Test Inc.</bill_to_company>
    <bill_to_title>Dr.</bill_to_title>
    <bill_to_first_name>Tester</bill_to_first_name>
    <bill_to_last_name>Testerson</bill_to_last_name>
    <bill_to_address1>2350 NW York Street</bill_to_address1>
    <bill_to_address2>Suite A</bill_to_address2>
    <bill_to_city>Portland</bill_to_city>
    <bill_to_state>OR</bill_to_state>
    <bill_to_zip>97210</bill_to_zip>
    <bill_to_country>United States</bill_to_country>
    <tax_county/>
    <gift>no</gift>
    <email>tester@example.com</email>
    <mailing_list>N</mailing_list>
    <day_phone>503-555-1212</day_phone>
    <evening_phone/>
    <fax/>
    <card_type>MasterCard</card_type>
    <card_number>1234</card_number>
    <card_exp_month>10</card_exp_month>
    <card_exp_year>2020</card_exp_year>
    <card_auth_ticket>12345X</card_auth_ticket>
    <payment_method>Credit Card</payment_method>
    <weight>1 LB</weight>
    <subtotal>5.00</subtotal>
    <tax_rate>0.00000</tax_rate>
    <tax>0.00</tax>
    <surcharge_transaction_fee>0.00</surcharge_transaction_fee>
    <surcharge_transaction_percentage>0.0000</surcharge_transaction_percentage>
    <surcharge>0.00</surcharge>
    <total>7.00</total>
    <currency_code/>
    <actual_profit_analyzed>N</actual_profit_analyzed>
    <actual_profit_review>N</actual_profit_review>
    <actual_other_cost/>
    <actual_fulfillment/>
    <actual_payment_processing/>
    <actual_profit/>
    <subtotal_discount_refunded>0</subtotal_discount_refunded>
    <subtotal_refunded>5</subtotal_refunded>
    <tax_refunded>0</tax_refunded>
    <buysafe_refunded>0</buysafe_refunded>
    <total_refunded>7</total_refunded>
    <refund_by_user>USER</refund_by_user>
    <refund_dts>02 JAN 2015 12:00:00</refund_dts>
    <gift_certificate_amount>0.00</gift_certificate_amount>
    <special_instructions/>
    <merchant_notes>Accidentally purchased two.</merchant_notes>
    <subtotal_discount>0.00</subtotal_discount>
    <gift_charge_accounting_code/>
    <gift_wrap_accounting_code/>
    <surcharge_accounting_code/>
    <payment_method_accounting_code/>
    <payment_method_deposit_to_account/>
    <tax_country_accounting_code/>
    <tax_state_accounting_code/>
    <tax_county_accounting_code/>
    <tax_city_accounting_code/>
    <tax_postal_code_accounting_code/>
    <referral_code/>
    <advertising_source>Web</advertising_source>
    <screen_branding_theme_code>THEME-X</screen_branding_theme_code>
    <has_customer_profile>Y</has_customer_profile>
    <customer_ip_address>127.0.0.1</customer_ip_address>
    <test_order>false</test_order>
  </order>
</export>
